In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /home/nyanmyosett/.local/lib/python3.10/site-packages (1.4.4)
Requirement already satisfied: pytz>=2020.1 in /usr/lib/python3/dist-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in /home/nyanmyosett/.local/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in /home/nyanmyosett/.local/lib/python3.10/site-packages (from pandas) (1.23.2)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
data = {
    'Sqft' : [500, 750, 300, 450],
    'Price' : [25000, 37500, 15000, 22500]
}
housing = pd.DataFrame(data)
housing

   Sqft  Price
0   500  25000
1   750  37500
2   300  15000
3   450  22500

In [4]:
housing = pd.DataFrame(data, index=['H001', 'H002', 'H003', 'H004'])
housing

      Sqft  Price
H001   500  25000
H002   750  37500
H003   300  15000
H004   450  22500

In [5]:
housing.loc['H003']

Sqft       300
Price    15000
Name: H003, dtype: int64

In [6]:
housing.loc['H001': 'H004']

      Sqft  Price
H001   500  25000
H002   750  37500
H003   300  15000
H004   450  22500

In [7]:
housing.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, H001 to H004
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sqft    4 non-null      int64
 1   Price   4 non-null      int64
dtypes: int64(2)
memory usage: 268.0+ bytes

In [9]:
housing.shape

(4, 2)

In [14]:
housing = housing.append({
    'Sqft' : 400, 
    'Price' : 35000}, 
     ignore_index = True
)
housing

/tmp/ipykernel_7730/4164741049.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  housing = housing.append({

   Sqft  Price
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  35000
5   400  35000

In [16]:
more_housing = housing.append(housing, ignore_index = True)
more_housing

/tmp/ipykernel_7730/3239127748.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  more_housing = housing.append(housing, ignore_index = True)

    Sqft  Price
0    500  25000
1    750  37500
2    300  15000
3    450  22500
4    400  35000
5    400  35000
6    500  25000
7    750  37500
8    300  15000
9    450  22500
10   400  35000
11   400  35000

In [17]:
housing.describe()

             Sqft         Price
count    6.000000      6.000000
mean   466.666667  28333.333333
std    153.839743   8897.565210
min    300.000000  15000.000000
25%    400.000000  23125.000000
50%    425.000000  30000.000000
75%    487.500000  35000.000000
max    750.000000  37500.000000

In [19]:
more_housing.head(7)

   Sqft  Price
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  35000
5   400  35000
6   500  25000

In [20]:
more_housing.tail(3)

    Sqft  Price
9    450  22500
10   400  35000
11   400  35000

In [21]:
housing.columns

Index(['Sqft', 'Price'], dtype='object')

In [24]:
housing.rename(columns = {'Sqft' : 'sqft', 'Price': 'price'}, inplace = True)
housing

   sqft  price
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  35000
5   400  35000

In [25]:
housing.columns = ['Size', '$']
housing

   Size      $
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  35000
5   400  35000